import React, { useState } from 'react';
import './Conditions.css';

const Conditions = () => {
  const [isExpanded, setIsExpanded] = useState(false);

  const toggleConditions = () => {
    setIsExpanded(!isExpanded);
  };

  return (
    <div className="conditions-wrapper">
      <div className="conditions">
        <h2 onClick={toggleConditions} className={isExpanded ? '' : 'collapsed'}>
          الشروط العامة المشتركة
        </h2>
        <ul className={isExpanded ? 'show' : ''}>
          <li>أن يكون المتقدم مصري الجنسية وطبيعيًا وليس اعتباريًا.</li>
          <li>ألا يقل عمر المتقدم عن 21 عامًا وقت التقديم, وأن يكون له الأهلية القانونية للتصرف والتعاقد.</li>
          <li>يخضع الحجز لأحكام القانون رقم 59 لسنة 1979 بشأن إنشاء المجتمعات العمرانية الجديدة, وأحكام قانون التمويل العقاري وقرارات البنك المركزي المصري ذات الصلة.</li>
          <li>لا يحق للأسرة (الزوج والزوجة والأولاد القصر) التقدم لحجز أكثر من وحدة في نفس المشروع.</li>
          <li>يُسمح للأعزب بحجز وحدة واحدة فقط في نفس الطرح.</li>
          <li>يعتبر الإعلان وكراسة الشروط جزءًا لا يتجزأ من عقد البيع.</li>
          <li>يُعد سداد جدية الحجز موافقة نهائية على الشروط والمواصفات.</li>
          <li>الوحدات مخصصة للسكن فقط, ولا يجوز تغيير الغرض من استخدامها.</li>
          <li>في حال المخالفة يتم سحب الوحدة واتخاذ الإجراءات القانونية.</li>
        </ul>
      </div>
      <div className="note">
        <p>
          <strong>ملحوظة خاصة بوحدات الروف (البنتهاوس):</strong> في جميع المشاريع، إذا كان التقديم لحجز وحدات البنتهاوس, فإن سعر المتر المربع لمساحة الروف الخاصة بها يكون 50% من سعر المتر للوحدة السكنية، بخلاف التميز.
        </p>
      </div>
    </div>
  );
};

export default Conditions;
